#include <HAL.h>
#include <EERTOS.h>



// Прототипы задач ============================================================

// Global Variables






//RTOS Interrupt
ISR(RTOS_ISR)
{
sei();
TimerService();						// Прерывание ядра диспетчера
}
//..........................................................................




//============================================================================
//Область задач
//============================================================================


//==============================================================================
int main(void)
{
InitAll();			// Инициализируем периферию
InitRTOS();			// Инициализируем ядро
RunRTOS();			// Старт ядра. 

while(1) 		// Главный цикл диспетчера
{
wdt_reset();	// Сброс собачьего таймера
TaskManager();	// Вызов диспетчера
}

return 0;
}



